Repository: pndaza/tipitaka-pali
Catalog: lib/l10n/app_*.arb
Languages: my, vi, zh

source: Tipitaka Pali Reader
my: တိပိဋကပါဠိဖတ်စာ
zh: 巴利三藏阅读

source: Home
my: စာအုပ်စင်
zh: 返回

source: Bookmark
my: မှတ်စု
vi: Đánh dấu
zh: 书签

source: Recent
my: ဖတ်ဆဲ
vi: Gần đây
zh: 最近读过

source: Search
my: စာရှာ
vi: Tìm kiếm
zh: 查询

# updatingStatus
source: Please wait while updating database This may take a few minutes
my: အချက်အလက်အသစ်များ ထည့်သွင်းနေပါသည်။ ခေတ္တစောင့်ပါ
vi: Vui lòng chờ trong khi cập nhật dữ liệu. Có thể cần đến vài phút.
zh: 数据更新中，请等待 有可能需要几分钟

# copyingStatus
source: Please wait while copying database. This may take a few minutes
my: အချက်အလက်များ ထည့်သွင်းနေပါသည်။ ခေတ္တစောင့်ပါ
vi: Vui lòng chờ trong khi sao chép dữ liệu. Có thể cần đến vài phút.
zh: 数据拷贝中，请等待 有可能需要几分钟

source: Settings
my: ဆက်တင်များ
vi: Cài đặt
zh: 设置

source: dictionary
my: အဘိဓာန်
vi: Từ điển
zh: 词典

source: Theme
my: အရောင်
vi: Tông màu
zh: 主题

# darkMode
source: Page
my: အမှောင်နောက်ခံ
vi: Tông tối
zh: 暗色模式

source: Language
my: ဘာသာစကား
vi: Ngôn ngữ
zh: 语言

source: Dictionaries
my: အဘိဓာန်များ
vi: Từ điển
zh: 辞典

# paliScript
source: Pāḷi Script
my: စာသားဖော်ပြမှု
vi: Ký tự Pāḷi
zh: 巴利原文

# showAlternatePali
source: Show Alternate Pāḷi
my: မူကွဲပါဠိ ဖော်ပြပါ
vi: Hiện dị bản Pāḷi
zh: 显示其它巴利

source: Show PTS PageNumber
my: PTSမူစာမျက်နှာ ပြ
vi: Hiện số trang PTS
zh: 显示PTS页码

source: Show Thai PageNumber
my: ထိုင်းမူစာမျက်နှာ ပြ
vi: Hiện số trang tạng Thái
zh: 显示泰文页码

source: About
my: အကြောင်းအရာ
vi: Thông tin
zh: 关于

# about_info
source: This is a new attempt to make the best Pāḷi reading app ever made. To do this, Flutter was chosen as the new language with a SQLite database. This is a major release and should be more usable than previous versions. A Desktop version is expected to be ready by January, 2023. This version contains the September, 2022 edition of The Digital Pāḷi Dictionary created by Ven Bodhirasa as Creative Commons license. The ​DPD website is here: https://digitalpalidictionary.github.io/ . We owe many thanks to this venerable for providing permission as well as formatted data tables. His work is ongoing and active and we plan to have a dictionary updater without the need to upgrade the application. Most of the code was written by Venerable Pandazza while I did most of the project management with some code additions. The PEU (Pāḷi English Ultimate) Is a translated version of the abbreviated Pāli Myanmar Abhidhān Dictionary. This is an ongoing project translated by humans and Google. There are 168,000 entries with 72,000 translated by humans. It is quite useful to help you get the meaning of some difficult words not found in any other dictionary. You can create issues and request features on the github website https://github.com/bksubhuti/tipitaka-pali-reader/issues , The Pāḷi is claimed to be copyright by VRI, The logo book is modified internet picture, Buddhaghosa or ajahn Jayaysaro youtube.
my: ကျမ်းစာများ ပါဠိ၊ အဋ္ဌကထာ၊ ဋီကာ နှင့် အခြား ပိဋကတ်ဆိုင်ရာ ကျမ်းစာများ ပါဝင်ပါသည်။ စာရှာ ယူနီကုဒ်အသုံးပြု၍ ရှာနိုင်ပါသည်။ ( ဇော်ဂျီဖြင့် မရပါ။ ) ပုဒ်တပုဒ်တည်းသာ မကဘဲ နှစ်ပုဒ်တွဲအားဖြင့်လည်း ရှာနိုင်ပါသည်။ (သုံးပုဒ်တွဲနှင့်အထက် မရသေးပါ။) တပုဒ်တည်း ရှာဖွေရာအခါ၌ လမ်းညွှန်ပုဒ်များ ( suggestion words ) ကို ပြသပေးပါလိမ့်မည်။ အဘိဓာန်ကြည့် စကားလုံးပေါ်ထောက်၍ "အဘိဓာန်ကြည့်ရှုနိုင်ပါသည်။" ပကတိပုဒ်ရင်းကို အမှန်အတိုင်း မှန်းမဆရ၍ မှားယွင်းစွာ ပြသနေပါက တည်ပုဒ်ကို ကိုယ်တိုင် ပြင်ဆင်၍ ကြည့်ရှုနိုင်ပါသည်။
vi: This app is still in Beta. However, it should be useful for accessing the Tipitaka Texts, and getting most dictionary definitions. You can create issues and request features on the github website https://github.com/bksubhuti/tipitaka-pali-reader/issues
zh: 本应用目前为试用版。 尽管如此，它依然可以帮您利用巴利三藏文本并检索到绝大部分的词典释义。 您可以访问以下地址创建话题请求相关素材： https://github.com/bksubhuti/tipitaka-pali-reader/issues

# unable_open_page
source: Unable to open page for this page.
my: ယခု စာမျက်နှာအတွက် အဖွင့် ကြည့်ရှု မရနိုင်ပါ။
vi: Không thể mở trang này.
zh: 无法打开此处页面

# enter_note
source: Enter note here
my: မှတ်လိုသောစာသား ထည့်ပါ
vi: Nhập ghi chú ở đây
zh: 此处建立笔记

source: Save
my: မှတ်မယ်
vi: Lưu
zh: 保存

source: Cancel
my: မမှတ်တော့ဘူး
vi: Hủy
zh: 取消

source: page
my: နှာ
vi: trang
zh: 页面

source: Select paragraph
my: အဖွင့်ကြည့်လိုသော စာပိုဒ်ရွေးပါ
vi: Chọn Đoạn
zh: 选择段落

source: Close
my: ပိတ်
vi: Đóng
zh: 关闭

# paragraph_number
source: Commentaries of Paragraph
my: စာပိုဒ်အမှတ်
vi: Số Đoạn
zh: 段落编号

source: Table Of Contents
my: မာတိကာ
vi: Mục Lục
zh: 目录

source: Goto
my: သို့
vi: Đitới
zh: 前往

source: Paragraph
my: စာပိုဒ်
vi: Đoạn
zh: 段落

source: Go
my: သွား
vi: đi

source: TOC
my: မာတိကာ

source: MAT
my: အဖွင့်

source: Font
my: ဖောင့်
zh: 字体

source: Exact
my: အတိအကျ
vi: Tìm chính xác
zh: 精确

source: Prefix
my: အစတူ
vi: Tìm tiền tố
zh: 前缀

source: Distance
my: ပုဒ်အကွာအဝေး
vi: Tìm cách khoảng
zh: 间距

# anywhere
source: Any Part
my: မည်သည့်အပိုင်းမဆို
vi: Bất cứ đâu
zh: 任意位置

# openingBook
source: Openning Books
my: အဖွင့်စာအုပ်
vi: Mở sách
zh: 打开的书籍

# animationSpeed
source: Animation Speed in ms
my: လှုပ်ရှားမှုအရှိန်
vi: Tốc độ hoạt ảnh ms
zh: 动画加速ms

# generalSettings
source: General
my: အထွေထွေပြုပြင်ရန်
vi: Tổng Quát
zh: 设置

source: Increase font size
my: စာလုံးအရွယ်အစားချဲ့ခြင်း
vi: Tăng phông chữ
zh: 字体放大

source: Decrease font size
my: စာလုံးအရွယ်အစားချုံ့ခြင်း
vi: Giảm phông chữ
zh: 字体缩小

source: Open linked book
my: ချိတ်ထားသောစာအုပ်ကိုဖွင့်ရန်
vi: Mở sách liên kết
zh: 关联书籍

# gotoPageParagraph
source: Goto page or paragraph
my: စာမျက်နှာအပိုဒ်သို့သွားရန်
vi: Tới trang hay đoạn văn
zh: 前往页码或段落

source: Show VRI PageNumber
vi: Hiện số trang VRI
zh: 显示VRI页码
